#Напишите программу, в которой вычисляется сумма, разность и произведение двух целых чисел, введенных с клавиатуры.
a, b = int(input()), int(input())
print(f"{a} + {b} = {a+b}")