a = int(input())
v = a**3
s = 6*(a**2)
print("Объем = " + str(v))
print("Площадь полной поверхности = " + str(s))

#Напишите программу вычисления значения функции
a, b = int(input()), int(input())
result = 3*((a+b)**3)+275*(b**2) - 127*a - 41

print(result)